{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"state": {"name": "state:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "24"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}, "entropy": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "Identity_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mul_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/RandomNormalLike/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transpose", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mul_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transpose_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mul_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transpose_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mul_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/onnx_tf_prefix_/Div_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Sub_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "state", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "24"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/RandomNormalLike/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/RandomNormalLike/shape"], "attr": {"seed2": {"i": "0"}, "seed": {"i": "0"}, "T": {"type": "DT_INT64"}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/flatten/Reshape", "op": "Reshape", "input": ["state", "StatefulPartitionedCall/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mul_9", "StatefulPartitionedCall/onnx_tf_prefix_/RandomNormalLike/RandomStandardNormal"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/flatten/Reshape", "StatefulPartitionedCall/transpose", "StatefulPartitionedCall/mul_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/actions_mean/actions_mean.1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/actions_mean/actions_mean.1/Tanh", "StatefulPartitionedCall/transpose_1", "StatefulPartitionedCall/mul_3"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/actions_mean/actions_mean.3/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/add_2", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/actions_mean/actions_mean.3/Tanh", "StatefulPartitionedCall/transpose_2", "StatefulPartitionedCall/mul_5"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Mul_2", "StatefulPartitionedCall/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Sub", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Add_2", "StatefulPartitionedCall/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Div", "op": "Mul", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Neg", "ConstantFolding/StatefulPartitionedCall/onnx_tf_prefix_/Div_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Div", "StatefulPartitionedCall/onnx_tf_prefix_/Sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Identity_1", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mul_9", "shape": [1, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/RandomNormalLike/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/transpose", "shape": [24, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mul_1", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/transpose_1", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mul_3", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/transpose_2", "shape": [64, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mul_5", "shape": [4], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/onnx_tf_prefix_/Div_recip", "shape": [1, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Sub_1", "shape": [1, 4], "dtype": "float32"}]}]}